wrk_bench/h1_async.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 3.018ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.033ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 3.055ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 2.686ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.86ms    3.01ms  25.01ms   88.13%
    Req/Sec    15.56k     2.52k   27.28k    75.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.86ms
 75.000%    2.84ms
 90.000%    7.27ms
 99.000%   13.89ms
 99.900%   18.99ms
 99.990%   22.35ms
 99.999%   24.16ms
100.000%   25.02ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.041     0.000000            1         1.00
       0.791     0.100000       293320         1.11
       1.101     0.200000       585523         1.25
       1.364     0.300000       878184         1.43
       1.608     0.400000      1170434         1.67
       1.860     0.500000      1462912         2.00
       1.998     0.550000      1609043         2.22
       2.149     0.600000      1755550         2.50
       2.325     0.650000      1901806         2.86
       2.545     0.700000      2048307         3.33
       2.835     0.750000      2194078         4.00
       3.025     0.775000      2267384         4.44
       3.261     0.800000      2340178         5.00
       3.603     0.825000      2413120         5.71
       4.175     0.850000      2486492         6.67
       5.431     0.875000      2559413         8.00
       6.343     0.887500      2596026         8.89
       7.267     0.900000      2632530        10.00
       8.131     0.912500      2669089        11.43
       8.983     0.925000      2705922        13.33
       9.823     0.937500      2742447        16.00
      10.231     0.943750      2760644        17.78
      10.647     0.950000      2779021        20.00
      11.047     0.956250      2797335        22.86
      11.439     0.962500      2815548        26.67
      11.879     0.968750      2833710        32.00
      12.119     0.971875      2842709        35.56
      12.367     0.975000      2852049        40.00
      12.631     0.978125      2861242        45.71
      12.903     0.981250      2870192        53.33
      13.215     0.984375      2879290        64.00
      13.391     0.985938      2883990        71.11
      13.575     0.987500      2888546        80.00
      13.767     0.989062      2893109        91.43
      13.983     0.990625      2897653       106.67
      14.247     0.992188      2902187       128.00
      14.407     0.992969      2904481       142.22
      14.583     0.993750      2906752       160.00
      14.783     0.994531      2909007       182.86
      15.023     0.995313      2911254       213.33
      15.351     0.996094      2913576       256.00
      15.583     0.996484      2914718       284.44
      15.871     0.996875      2915831       320.00
      16.215     0.997266      2916970       365.71
      16.671     0.997656      2918138       426.67
      17.231     0.998047      2919266       512.00
      17.535     0.998242      2919827       568.89
      17.871     0.998437      2920412       640.00
      18.175     0.998633      2920969       731.43
      18.575     0.998828      2921545       853.33
      19.039     0.999023      2922130      1024.00
      19.311     0.999121      2922397      1137.78
      19.631     0.999219      2922681      1280.00
      19.967     0.999316      2922966      1462.86
      20.383     0.999414      2923252      1706.67
      20.671     0.999512      2923541      2048.00
      20.847     0.999561      2923689      2275.56
      21.023     0.999609      2923824      2560.00
      21.215     0.999658      2923967      2925.71
      21.439     0.999707      2924121      3413.33
      21.615     0.999756      2924255      4096.00
      21.743     0.999780      2924327      4551.11
      21.839     0.999805      2924393      5120.00
      21.951     0.999829      2924465      5851.43
      22.079     0.999854      2924536      6826.67
      22.223     0.999878      2924610      8192.00
      22.287     0.999890      2924643      9102.22
      22.367     0.999902      2924686     10240.00
      22.431     0.999915      2924715     11702.86
      22.511     0.999927      2924754     13653.33
      22.591     0.999939      2924791     16384.00
      22.655     0.999945      2924807     18204.44
      22.719     0.999951      2924822     20480.00
      22.847     0.999957      2924840     23405.71
      23.023     0.999963      2924857     27306.67
      23.183     0.999969      2924875     32768.00
      23.263     0.999973      2924884     36408.89
      23.407     0.999976      2924893     40960.00
      23.535     0.999979      2924902     46811.43
      23.695     0.999982      2924911     54613.33
      23.919     0.999985      2924920     65536.00
      23.967     0.999986      2924924     72817.78
      24.031     0.999988      2924929     81920.00
      24.095     0.999989      2924933     93622.86
      24.239     0.999991      2924938    109226.67
      24.319     0.999992      2924942    131072.00
      24.351     0.999993      2924944    145635.56
      24.399     0.999994      2924950    163840.00
      24.399     0.999995      2924950    187245.71
      24.415     0.999995      2924951    218453.33
      24.431     0.999996      2924953    262144.00
      24.463     0.999997      2924955    291271.11
      24.495     0.999997      2924956    327680.00
      24.511     0.999997      2924958    374491.43
      24.511     0.999998      2924958    436906.67
      24.527     0.999998      2924959    524288.00
      24.527     0.999998      2924959    582542.22
      24.559     0.999998      2924960    655360.00
      24.703     0.999999      2924961    748982.86
      24.703     0.999999      2924961    873813.33
      24.975     0.999999      2924963   1048576.00
      24.975     0.999999      2924963   1165084.44
      24.975     0.999999      2924963   1310720.00
      24.975     0.999999      2924963   1497965.71
      24.975     0.999999      2924963   1747626.67
      24.975     1.000000      2924963   2097152.00
      24.975     1.000000      2924963   2330168.89
      24.975     1.000000      2924963   2621440.00
      25.023     1.000000      2924964   2995931.43
      25.023     1.000000      2924964          inf
#[Mean    =        2.862, StdDeviation   =        3.010]
#[Max     =       25.008, Total count    =      2924964]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543483 requests in 1.00m, 6.91GB read
Requests/sec:  59058.21
Transfer/sec:    117.94MB