wrk_bench/h1_async.txt
Running 1m test @ http://localhost:8080
  4 threads and 1000 connections
  Thread calibration: mean lat.: 5.155ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 5.251ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 3.996ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 5.537ms, rate sampling interval: 21ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.02ms    3.88ms  29.63ms   74.81%
    Req/Sec    15.40k     2.78k   27.11k    75.28%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.33ms
 75.000%    6.51ms
 90.000%   10.49ms
 99.000%   17.74ms
 99.900%   23.12ms
 99.990%   26.90ms
 99.999%   29.06ms
100.000%   29.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            2         1.00
       1.042     0.100000       292547         1.11
       1.685     0.200000       585147         1.25
       2.495     0.300000       877615         1.43
       3.409     0.400000      1170168         1.67
       4.327     0.500000      1463501         2.00
       4.743     0.550000      1609394         2.22
       5.147     0.600000      1755153         2.50
       5.559     0.650000      1901850         2.86
       5.999     0.700000      2048337         3.33
       6.511     0.750000      2194544         4.00
       6.819     0.775000      2267439         4.44
       7.183     0.800000      2340376         5.00
       7.671     0.825000      2413231         5.71
       8.367     0.850000      2486787         6.67
       9.343     0.875000      2559420         8.00
       9.911     0.887500      2596394         8.89
      10.487     0.900000      2632486        10.00
      11.103     0.912500      2669204        11.43
      11.767     0.925000      2705986        13.33
      12.463     0.937500      2742399        16.00
      12.815     0.943750      2760500        17.78
      13.207     0.950000      2778756        20.00
      13.663     0.956250      2797185        22.86
      14.167     0.962500      2815490        26.67
      14.727     0.968750      2833692        32.00
      15.023     0.971875      2842716        35.56
      15.367     0.975000      2852043        40.00
      15.735     0.978125      2861155        45.71
      16.159     0.981250      2870188        53.33
      16.655     0.984375      2879431        64.00
      16.927     0.985938      2883982        71.11
      17.215     0.987500      2888638        80.00
      17.535     0.989062      2893166        91.43
      17.903     0.990625      2897657       106.67
      18.367     0.992188      2902197       128.00
      18.671     0.992969      2904450       142.22
      19.007     0.993750      2906763       160.00
      19.343     0.994531      2909058       182.86
      19.711     0.995313      2911303       213.33
      20.143     0.996094      2913576       256.00
      20.367     0.996484      2914719       284.44
      20.687     0.996875      2915863       320.00
      21.023     0.997266      2916988       365.71
      21.391     0.997656      2918166       426.67
      21.855     0.998047      2919268       512.00
      22.079     0.998242      2919873       568.89
      22.335     0.998437      2920434       640.00
      22.591     0.998633      2920988       731.43
      22.863     0.998828      2921564       853.33
      23.167     0.999023      2922127      1024.00
      23.407     0.999121      2922411      1137.78
      23.695     0.999219      2922696      1280.00
      23.967     0.999316      2922981      1462.86
      24.207     0.999414      2923271      1706.67
      24.607     0.999512      2923553      2048.00
      24.799     0.999561      2923695      2275.56
      24.943     0.999609      2923836      2560.00
      25.151     0.999658      2923979      2925.71
      25.359     0.999707      2924122      3413.33
      25.599     0.999756      2924260      4096.00
      25.727     0.999780      2924332      4551.11
      25.919     0.999805      2924407      5120.00
      26.143     0.999829      2924478      5851.43
      26.495     0.999854      2924547      6826.67
      26.719     0.999878      2924621      8192.00
      26.799     0.999890      2924652      9102.22
      26.927     0.999902      2924689     10240.00
      27.119     0.999915      2924725     11702.86
      27.359     0.999927      2924761     13653.33
      27.503     0.999939      2924795     16384.00
      27.599     0.999945      2924813     18204.44
      27.887     0.999951      2924832     20480.00
      27.983     0.999957      2924849     23405.71
      28.159     0.999963      2924866     27306.67
      28.351     0.999969      2924887     32768.00
      28.415     0.999973      2924895     36408.89
      28.527     0.999976      2924902     40960.00
      28.687     0.999979      2924914     46811.43
      28.719     0.999982      2924920     54613.33
      28.767     0.999985      2924929     65536.00
      28.815     0.999986      2924933     72817.78
      28.863     0.999988      2924938     81920.00
      29.007     0.999989      2924942     93622.86
      29.071     0.999991      2924947    109226.67
      29.087     0.999992      2924952    131072.00
      29.103     0.999993      2924953    145635.56
      29.135     0.999994      2924959    163840.00
      29.135     0.999995      2924959    187245.71
      29.151     0.999995      2924962    218453.33
      29.151     0.999996      2924962    262144.00
      29.183     0.999997      2924963    291271.11
      29.359     0.999997      2924965    327680.00
      29.375     0.999997      2924967    374491.43
      29.375     0.999998      2924967    436906.67
      29.439     0.999998      2924969    524288.00
      29.439     0.999998      2924969    582542.22
      29.439     0.999998      2924969    655360.00
      29.455     0.999999      2924971    748982.86
      29.455     0.999999      2924971    873813.33
      29.455     0.999999      2924971   1048576.00
      29.455     0.999999      2924971   1165084.44
      29.455     0.999999      2924971   1310720.00
      29.615     0.999999      2924972   1497965.71
      29.615     0.999999      2924972   1747626.67
      29.615     1.000000      2924972   2097152.00
      29.615     1.000000      2924972   2330168.89
      29.615     1.000000      2924972   2621440.00
      29.647     1.000000      2924973   2995931.43
      29.647     1.000000      2924973          inf
#[Mean    =        5.023, StdDeviation   =        3.875]
#[Max     =       29.632, Total count    =      2924973]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3543834 requests in 1.00m, 6.91GB read
Requests/sec:  59063.50
Transfer/sec:    117.95MB